import pandas as pd

data = {
    'Grades': ['Grade1', 'Grade2', 'Grade3', 'Grade4', 'Grade5', 'Grade6', 'Grade7', 'Grade8', 'Grade9', 'Grade10', 'Grade11', 'Grade12'],
    'Денис': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 5, 6],
    'Максим': [2, 5, 7, 3, 2, 11, 10, 9, 9, 11, 2, 4],
    'Дмитро': [9, 2, 8, 4, 4, 2, 6, 4, 5, 12, 11, 10],
    'Софія': [3, 6, 2, 4, 5, 2, 5, 7, 9, 10, 9, 8],
    'Олег': [4, 5, 7, 8, 2, 7, 9, 10, 11, 8, 4, 7],
    'Марина': [10, 8, 7, 5, 8, 2, 7, 9, 11, 12, 4, 8],
    'Едуард': [3, 4, 2, 5, 10, 8, 7, 5, 7, 8, 9, 4],
    'Тарас': [5, 8, 2, 11, 4, 2, 5, 10, 8, 7, 7, 3],
    'Іван': [12, 5, 6, 7, 8, 2, 11, 4, 2, 5, 6, 8],
    'Володимир': [11, 7, 8, 9, 5, 6, 7, 8, 2, 11, 1, 12],
}

df = pd.DataFrame(data)
print(df,'\n\n')

df.set_index('Grades', inplace=True)

average_scores = df.mean()

print('Середні оцінки кожного учня:\n')
print(average_scores)